openfoam_cases/singleHeatSink/constant/bottomWater/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/bottomWater/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    minX
    {
        type            patch;
        nFaces          50;
        startFace       3858;
    }
    maxX
    {
        type            patch;
        nFaces          50;
        startFace       3908;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          292;
        startFace       3958;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       4250;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       4400;
    }
    bottomWater_to_rightSolid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          130;
        startFace       4550;
        sampleMode      nearestPatchFace;
        sampleRegion    rightSolid;
        samplePatch     rightSolid_to_bottomWater;
    }
    bottomWater_to_leftSolid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          130;
        startFace       4680;
        sampleMode      nearestPatchFace;
        sampleRegion    leftSolid;
        samplePatch     leftSolid_to_bottomWater;
    }
    bottomWater_to_heater
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          92;
        startFace       4810;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_bottomWater;
    }
)

// ************************************************************************* //
